README.org
#+STARTUP: indent
#+TITLE: README: Convolution Lagrangian Perturbation Theory (CLPT) and Gaussian Streaming Redshift-Space Distortions (GSRSD)
#+AUTHOR: Lile Wang
#+EMAIL: wll9004@gmail.com
#+OPTIONS: ^:nil
#+LANGUAGE: en

* Copyright and warranty info
This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or (at
your option) any later version.

This program is distributed in the hope that it will be useful, but
WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
General Public License for more details.

** The following people also contributed to this code:

- Alejandro Aviles

- Martin White

* Introduction

This package contains two separated programs: CLPT and GSRSD. Those
two programs are coded separately, but GSRSD uses the output of CLPT
directly. For the overall reference, please refer to:

http://adsabs.harvard.edu/abs/2014MNRAS.437..588W

** Important changes

Compared to the previous version, the $\sigma^2$ (velocity dispersion)
output files, generated by the CLPT part, are merged into one file
(and the GSRSD part has already been modified accordingly). See the
corresponding section in this README for details.

The two packages are now parallelized with OpenMP.

** Compilation and dependencies

CLPT and GSRSD are both written in standard C++-11 (also works with
C++-0x; gcc version > 4.4 will do this correctly)--and nothing
else. If you are working under Linux and have g++ and GNUMake in your
computer, you can just get into each directory and type "make"
respectively.

Both packages contain OpenMP parallelization. If you are using
Clang/LLVM, which does not officialy support OpenMP today, you may
want to remove the "=#include <omp.h>=" and "=omp_set_num_threads(
n_threads );=" statements in both "=main.cpp=" files. Or, instead, you
may want to try this:

https://clang-omp.github.io

The makefiles are written by a human, so you should find it easy to
modify them as needed (e.g. if you have gcc 4.4, you may want to use
the flag "-std=c++0x" instead of "-std=c++11" therein).

I named the output binary files as ".exe" files--the only purpose for
this is for git to recogize them easily and clearly.

* CLPT

This program gives real-space statistics, including correlation
functions and pairwise velocity statistics, coming from the CLPT.

For CLPT, please refer to:

http://adsabs.harvard.edu/abs/2013MNRAS.429.1674C

** Input

*** Parameter file

The CLPT code uses a parameter file to specify the parameters. There
is an example of parameter file ("par.txt") in the CLPT folder. You
can modify the parameter file (e.g. adjust the values or the sequence
of the keys), but please leave the header "CORR_FUNC" and "Init"
intact.

Some explanations:

| Key           | Value                                                                            |
|---------------+----------------------------------------------------------------------------------|
| r_max         | Maximum value of real-space separation that is calculated                        |
| r_min         | Minimum value of real-space separation                                           |
| r_bin_num     | Number of data points between r_min and r_max                                    |
| pow_spec_file | Path to the input file: Linear power spectrum                                    |
| xi_file       | Path to the output file: real-space $\xi(r)$                                     |
| v12_file      | Path to the output file: real-space pairwise infall velocity                     |
| s12_file      | Path to the output file: real-space pairwise velocity dispersion                 |
| k_input       | If specified, functions of k are read from file; if "none" or missing, they will |
|               | be calculated and stored into the file specified in key "k_output".              |
| k_output      | The path for the $k$-function output file.                                       |
| q_input       | Similar to "k_input". Note: Functions of q depend on functions of $k$            |
| q_output      | Similar to "k_output".                                                           |
| n_thread      | Number of threads that you will be using. If negative or missing, the number     |
|               | of threads will be determined by the env variable $OMP_NUM_THREADS               |

The file for the velocity dispersions will be attached a suffix: "_p"
for the parallel component, and "_v" for the perpandicular component.


*** Linear power spectrum

The CLPT program also needs a liear power spectrum as input, whose
path should be specified in the parameter file.

Definition of the file:

| Column | Value                                   |
|--------+-----------------------------------------|
|      1 | Wave number (in $\mathrm{h\ Mpc}^{-1}$) |
|      2 | Power [in $(\mathrm{Mpc\ h})^{-3}]$     |

** Run!

The name of the parameter file should be used as the parameter of
command-line input. For example, if you are using Linux and your
parameter file is named "par.txt", you may want to type the followings
in the terminal:
 
$ ./clpt.exe par.txt
  
