README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README: Convolution Lagrangian Perturbation Theory (CLPT) and Gaussian Streaming Redshift-Space Distortions (GSRSD)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="README: Convolution Lagrangian Perturbation Theory (CLPT) and Gaussian Streaming Redshift-Space Distortions (GSRSD)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-05-29T03:12-0400"/>
<meta name="author" content="Lile Wang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">README: Convolution Lagrangian Perturbation Theory (CLPT) and Gaussian Streaming Redshift-Space Distortions (GSRSD)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright and warranty info</a>
<ul>
<li><a href="#sec-1-1">1.1 The following people also contributed to this code:</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1 Important changes</a></li>
<li><a href="#sec-2-2">2.2 Compilation and dependencies</a></li>
</ul>
</li>
<li><a href="#sec-3">3 CLPT</a>
<ul>
<li><a href="#sec-3-1">3.1 Input</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 Parameter file</a></li>
<li><a href="#sec-3-1-2">3.1.2 Linear power spectrum</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 Run!</a></li>
<li><a href="#sec-3-3">3.3 Output</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 Real-space correlation function</a></li>
<li><a href="#sec-3-3-2">3.3.2 Real-space pairwise infall velocity.</a></li>
<li><a href="#sec-3-3-3">3.3.3 Real-space pairwise velocity dispersion</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 GSRSD</a>
<ul>
<li><a href="#sec-4-1">4.1 Input</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 Parameter file</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 Run!</a></li>
<li><a href="#sec-4-3">4.3 Output</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 &lt;out_file_name&gt;</a></li>
<li><a href="#sec-4-3-2">4.3.2 &lt;out_file_name&gt;_appendix</a></li>
<li><a href="#sec-4-3-3">4.3.3 &lt;out_file_name&gt;_wedge</a></li>
<li><a href="#sec-4-3-4">4.3.4 &lt;out_file_name&gt;_2d</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Copyright and warranty info</h2>
<div class="outline-text-2" id="text-1">

<p>This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or (at
your option) any later version.
</p>
<p>
This program is distributed in the hope that it will be useful, but
WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
General Public License for more details.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> The following people also contributed to this code:</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>Alejandro Aviles

</li>
<li>Martin White
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">


<p>
This package contains two separated programs: CLPT and GSRSD. Those
two programs are coded separately, but GSRSD uses the output of CLPT
directly. For the overall reference, please refer to:
</p>
<p>
<a href="http://adsabs.harvard.edu/abs/2014MNRAS.437..588W">http://adsabs.harvard.edu/abs/2014MNRAS.437..588W</a>
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Important changes</h3>
<div class="outline-text-3" id="text-2-1">


<p>
Compared to the previous version, the \(\sigma^2\) (velocity dispersion)
output files, generated by the CLPT part, are merged into one file
(and the GSRSD part has already been modified accordingly). See the
corresponding section in this README for details.
</p>
<p>
The two packages are now parallelized with OpenMP.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Compilation and dependencies</h3>
<div class="outline-text-3" id="text-2-2">


<p>
CLPT and GSRSD are both written in standard C++-11 (also works with
C++-0x; gcc version &gt; 4.4 will do this correctly)&ndash;and nothing
else. If you are working under Linux and have g++ and GNUMake in your
computer, you can just get into each folder and type "make"
respectively for the comilation.
</p>
<p>
Both packages contain OpenMP parallelization. If you are using
Clang/LLVM, which does not officialy support OpenMP today, you may
want to remove the "<code>#include &lt;omp.h&gt;</code>" and "<code>omp_set_num_threads( n_threads );</code>" statements in both "<code>main.cpp</code>" files. Or, instead, you
may want to try this:
</p>
<p>
<a href="https://clang-omp.github.io">https://clang-omp.github.io</a>
</p>
<p>
The makefiles are written by a human, so you should find it easy to
modify them as needed (e.g. if you have gcc 4.4, you may want to use
the flag "-std=c++0x" instead of "-std=c++11" therein).
</p>
<p>
I named the output binary files as ".exe" files&ndash;the only purpose for
this is for git to recogize them easily and clearly.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> CLPT</h2>
<div class="outline-text-2" id="text-3">


<p>
This program gives real-space statistics, including correlation
functions and pairwise velocity statistics, coming from the CLPT.
</p>
<p>
For CLPT, please refer to:
</p>
<p>
<a href="http://adsabs.harvard.edu/abs/2013MNRAS.429.1674C">http://adsabs.harvard.edu/abs/2013MNRAS.429.1674C</a>
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Input</h3>
<div class="outline-text-3" id="text-3-1">



</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Parameter file</h4>
<div class="outline-text-4" id="text-3-1-1">


<p>
The CLPT code uses a parameter file to specify the parameters. There
is an example of parameter file ("par.txt") in the CLPT folder. You
can modify the parameter file (e.g. adjust the values or the sequence
of the keys), but please leave the header "CORR_FUNC" and "Init"
intact.
</p>
<p>
Some explanations:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="left">r_max</td><td class="left">Maximum value of real-space separation that is calculated</td></tr>
<tr><td class="left">r_min</td><td class="left">Minimum value of real-space separation</td></tr>
<tr><td class="left">r_bin_num</td><td class="left">Number of data points between r_min and r_max</td></tr>
<tr><td class="left">pow_spec_file</td><td class="left">Path to the input file: Linear power spectrum</td></tr>
<tr><td class="left">xi_file</td><td class="left">Path to the output file: real-space \(\xi(r)\)</td></tr>
<tr><td class="left">v12_file</td><td class="left">Path to the output file: real-space pairwise infall velocity</td></tr>
<tr><td class="left">s12_file</td><td class="left">Path to the output file: real-space pairwise velocity dispersion</td></tr>
<tr><td class="left">k_input</td><td class="left">If specified, functions of k are read from file; if "none" or missing, they will</td></tr>
<tr><td class="left"></td><td class="left">be calculated and stored into the file specified in key "k_output".</td></tr>
<tr><td class="left">k_output</td><td class="left">The path for the \(k\)-function output file.</td></tr>
<tr><td class="left">q_input</td><td class="left">Similar to "k_input". Note: Functions of q depend on functions of \(k\)</td></tr>
<tr><td class="left">q_output</td><td class="left">Similar to "k_output".</td></tr>
<tr><td class="left">n_thread</td><td class="left">Number of threads that you will be using. If negative or missing, the number</td></tr>
<tr><td class="left"></td><td class="left">of threads will be determined by the env variable $OMP_NUM_THREADS</td></tr>
</tbody>
</table>


<p>
The file for the velocity dispersions will be attached a suffix: "_p"
for the parallel component, and "_v" for the perpandicular component.
</p>

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Linear power spectrum</h4>
<div class="outline-text-4" id="text-3-1-2">


<p>
The CLPT program also needs a liear power spectrum as input, whose
path should be specified in the parameter file.
</p>
<p>
Definition of the file:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Column</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="right">1</td><td class="left">Wave number (in \(\mathrm{h\ Mpc}^{-1}\))</td></tr>
<tr><td class="right">2</td><td class="left">Power [in \((\mathrm{Mpc\ h})^{-3}]\)</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Run!</h3>
<div class="outline-text-3" id="text-3-2">


<p>
The name of the parameter file should be used as the parameter of
command-line input. For example, if you are using Linux and your
parameter file is named "par.txt", you may want to type the followings
in the terminal:
</p>
<p> 
$ ./clpt.exe par.txt
</p>
</div>

</div>
