README.org
** Output

In our CLPT model, we use $\langle F'\rangle$ and $\langle F''\rangle$
as first- and second-order Lagrangian bias parameters. For a specific
statistics A, we calculate the value of A for biased tracers as:

$A = A_0 + A_{10} \langle F' \rangle + A_{01} \langle F'' \rangle +
A_{20} \langle F' \rangle^2 + A_{11} \langle F' \rangle\langle F''
\rangle + A_{02} \langle F'' \rangle^2$

In this section we will use this notation. 

*** Real-space correlation function

| Column | Value                                 |
|--------+---------------------------------------|
|      1 | $r$ (in $\mathrm{Mpc\ h}^{-1}$)       |
|      2 | $\xi_L$ (linear correlation function) |
|      3 | $\xi_0$                               |
|      4 | $\xi_{10}$                            |
|      5 | $\xi_{01}$                            |
|      6 | $\xi_{20}$                            |
|      7 | $\xi_{11}$                            |
|      8 | $\xi_{02}$                            |

*** Real-space pairwise infall velocity.

Veolicties are given in units of $v/(a H(a) f_v)$ (this gives the
results a dimension of distance), where a is the scale factor, $H(a)$ is
the Hubble parameter and $f_v$ is the growth factor.

| Column | Value                                 |
|--------+---------------------------------------|
|      1 | $r$ (in $\mathrm{Mpc\ h}^{-1}$)       |
|      2 | $v_{12,L}$ (linear pairwise velocity) |
|      3 | $v_{12,0}$                            |
|      4 | $v_{12,10}$                           |
|      5 | $v_{12,01}$                           |
|      6 | $v_{12,20}$                           |
|      7 | $v_{12,11}$                           |
|      8 | $v_{12,02}$                           |

*** Real-space pairwise velocity dispersion

| Column | Value                                                           |
|--------+-----------------------------------------------------------------|
|      1 | $r$ (in $\mathrm{Mpc\ h}^{-1}$)                                 |
|      2 | $\sigma^2_{\parallel, 12,0}$ (in $\mathrm{Mpc}^2/\mathrm{h}^2$) |
|      3 | $\sigma^2_{\parallel, 12,10}$                                   |
|      4 | $\sigma^2_{\parallel, 12,01}$                                   |
|      5 | $\sigma^2_{\parallel, 12,20}$                                   |
|      6 | $\sigma^2_{\bot, 12,0}$ (in $\mathrm{Mpc}^2/\mathrm{h}^2$)      |
|      7 | $\sigma^2_{\bot, 12,10}$                                        |
|      8 | $\sigma^2_{\bot, 12,01}$                                        |
|      9 | $\sigma^2_{\bot, 12,20}$                                        |

Other components vanish at the desired (one-loop) order.

* GSRSD

This program gives redshift-space statistics, including Legendre
expansion of correlation function and wedge statistics, coming from
the Gaussian streaming model.

For Gaussian streaming model, please refer to Beth & White (2011):

http://adsabs.harvard.edu/abs/2011MNRAS.417.1913R

For the "wedge" statistcis, you may find it in, such as,

http://adsabs.harvard.edu/abs/2011MNRAS.414..596W

** Input

*** Parameter file

The GSRSD code uses a parameter file to specify the parameters. There
is an example of parameter file ("par.txt") in the GSRSD folder. You
can modify the parameter file (e.g. adjust the values or the sequence
of the keys), but please leave the header "CORR_FUNC" and "Init"
intact.

Some explanations:

| Key           | Value                                                                        |
|---------------+------------------------------------------------------------------------------|
| fb11b20       | $\langle F' \rangle$                                                         |
| fb10b21       | $\langle F'' \rangle$                                                        |
| fb11b21       | $\langle F' \rangle \langle F'' \rangle$                                     |
| fb12b20       | $\langle F' \rangle^2$                                                       |
| fb10b22       | $\langle F'' \rangle^2$                                                      |
| sigma_p_100   | The value of $\sigma^2_\parallel$ at $100\ \mathrm{Mpc\ h}^{-1}$             |
| s_max         | Maximum separation in the redshift-space                                     |
| s_min         | Minimum separation                                                           |
| s_bin         | Number of data points between s_min and s_max                                |
| wedge_bin     | Number of data points for the "wedge" statistics                             |
| y_spanning    | The integration range of y (see Beth and White 2011)                         |
| dy            | The integration step of y                                                    |
| f_v           | Structure growth rate, $(\mathrm{d} \log D / \mathrm{d} \log a)$             |
| xi_file_name  | Path to the input file: real-space $\xi$                                     |
| v_file_name   | Path to the input file: real-space $v_{12}$                                  |
| s_file_name   | Path to the input file: real-space velocity dispersion                       |
| out_file_name | Path to the output file                                                      |
| n_thread      | Number of threads that you will be using. If negative or missing, the number |
|               | of threads will be determined by the env variable $OMP_NUM_THREADS           |

The wedge statistics will be given by "<out_file_name>_wedge", 2-D
plot by "<out_file_name>_2d", and some appendices will be given in
"<out_file_name>_appendix".

"fb1*b2*" are separately specified for the convenience of cross-correlation.

** Run!

Similar to the CLPT code... E.g.:

$ ./xi_stream.exe par.txt

** Output

*** <out_file_name>

All for biased tracers...

| Column | Value                                                      |
|--------+------------------------------------------------------------|
|      1 | $s$ (redshift-space separation, in $\mathrm{Mpc\ h}^{-1}$) |
|      2 | $\xi^s_0$ (monopole)                                       |
|      3 | $\xi^s_2$ (quadrupole)                                     |
|      4 | $\xi^s_4$ (hexadecapole)                                   |

