README.html

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Output</h3>
<div class="outline-text-3" id="text-3-3">


<p>
In our CLPT model, we use \(\langle F'\rangle\) and \(\langle F''\rangle\)
as first- and second-order Lagrangian bias parameters. For a specific
statistics A, we calculate the value of A for biased tracers as:
</p>


\(A = A_0 + A_{10} \langle F' \rangle + A_{01} \langle F'' \rangle +
A_{20} \langle F' \rangle^2 + A_{11} \langle F' \rangle\langle F''
\rangle + A_{02} \langle F'' \rangle^2\)

<p>
In this section we will use this notation. 
</p>

</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Real-space correlation function</h4>
<div class="outline-text-4" id="text-3-3-1">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Column</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="right">1</td><td class="left">\(r\) (in \(\mathrm{Mpc\ h}^{-1}\))</td></tr>
<tr><td class="right">2</td><td class="left">\(\xi_L\) (linear correlation function)</td></tr>
<tr><td class="right">3</td><td class="left">\(\xi_0\)</td></tr>
<tr><td class="right">4</td><td class="left">\(\xi_{10}\)</td></tr>
<tr><td class="right">5</td><td class="left">\(\xi_{01}\)</td></tr>
<tr><td class="right">6</td><td class="left">\(\xi_{20}\)</td></tr>
<tr><td class="right">7</td><td class="left">\(\xi_{11}\)</td></tr>
<tr><td class="right">8</td><td class="left">\(\xi_{02}\)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Real-space pairwise infall velocity.</h4>
<div class="outline-text-4" id="text-3-3-2">


<p>
Veolicties are given in units of \(v/(a H(a) f_v)\) (this gives the
results a dimension of distance), where a is the scale factor, \(H(a)\) is
the Hubble parameter and \(f_v\) is the growth factor.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Column</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="right">1</td><td class="left">\(r\) (in \(\mathrm{Mpc\ h}^{-1}\))</td></tr>
<tr><td class="right">2</td><td class="left">\(v_{12,L}\) (linear pairwise velocity)</td></tr>
<tr><td class="right">3</td><td class="left">\(v_{12,0}\)</td></tr>
<tr><td class="right">4</td><td class="left">\(v_{12,10}\)</td></tr>
<tr><td class="right">5</td><td class="left">\(v_{12,01}\)</td></tr>
<tr><td class="right">6</td><td class="left">\(v_{12,20}\)</td></tr>
<tr><td class="right">7</td><td class="left">\(v_{12,11}\)</td></tr>
<tr><td class="right">8</td><td class="left">\(v_{12,02}\)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Real-space pairwise velocity dispersion</h4>
<div class="outline-text-4" id="text-3-3-3">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Column</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="right">1</td><td class="left">\(r\) (in \(\mathrm{Mpc\ h}^{-1}\))</td></tr>
<tr><td class="right">2</td><td class="left">\(\sigma^2_{\parallel, 12,0}\) (in \(\mathrm{Mpc}^2/\mathrm{h}^2\))</td></tr>
<tr><td class="right">3</td><td class="left">\(\sigma^2_{\parallel, 12,10}\)</td></tr>
<tr><td class="right">4</td><td class="left">\(\sigma^2_{\parallel, 12,01}\)</td></tr>
<tr><td class="right">5</td><td class="left">\(\sigma^2_{\parallel, 12,20}\)</td></tr>
<tr><td class="right">6</td><td class="left">\(\sigma^2_{\bot, 12,0}\) (in \(\mathrm{Mpc}^2/\mathrm{h}^2\))</td></tr>
<tr><td class="right">7</td><td class="left">\(\sigma^2_{\bot, 12,10}\)</td></tr>
<tr><td class="right">8</td><td class="left">\(\sigma^2_{\bot, 12,01}\)</td></tr>
<tr><td class="right">9</td><td class="left">\(\sigma^2_{\bot, 12,20}\)</td></tr>
</tbody>
</table>


<p>
Other components vanish at the desired (one-loop) order.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> GSRSD</h2>
<div class="outline-text-2" id="text-4">


<p>
This program gives redshift-space statistics, including Legendre
expansion of correlation function and wedge statistics, coming from
the Gaussian streaming model.
</p>
<p>
For Gaussian streaming model, please refer to Beth &amp; White (2011):
</p>
<p>
<a href="http://adsabs.harvard.edu/abs/2011MNRAS.417.1913R">http://adsabs.harvard.edu/abs/2011MNRAS.417.1913R</a>
</p>
<p>
For the "wedge" statistcis, you may find it in, such as,
</p>
<p>
<a href="http://adsabs.harvard.edu/abs/2011MNRAS.414..596W">http://adsabs.harvard.edu/abs/2011MNRAS.414..596W</a>
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Input</h3>
<div class="outline-text-3" id="text-4-1">



</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Parameter file</h4>
<div class="outline-text-4" id="text-4-1-1">


<p>
The GSRSD code uses a parameter file to specify the parameters. There
is an example of parameter file ("par.txt") in the GSRSD folder. You
can modify the parameter file (e.g. adjust the values or the sequence
of the keys), but please leave the header "CORR_FUNC" and "Init"
intact.
</p>
<p>
Some explanations:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Key</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="left">fb11b20</td><td class="left">\(\langle F' \rangle\)</td></tr>
<tr><td class="left">fb10b21</td><td class="left">\(\langle F'' \rangle\)</td></tr>
<tr><td class="left">fb11b21</td><td class="left">\(\langle F' \rangle \langle F'' \rangle\)</td></tr>
<tr><td class="left">fb12b20</td><td class="left">\(\langle F' \rangle^2\)</td></tr>
<tr><td class="left">fb10b22</td><td class="left">\(\langle F'' \rangle^2\)</td></tr>
<tr><td class="left">sigma_p_100</td><td class="left">The value of \(\sigma^2_\parallel\) at \(100\ \mathrm{Mpc\ h}^{-1}\)</td></tr>
<tr><td class="left">s_max</td><td class="left">Maximum separation in the redshift-space</td></tr>
<tr><td class="left">s_min</td><td class="left">Minimum separation</td></tr>
<tr><td class="left">s_bin</td><td class="left">Number of data points between s_min and s_max</td></tr>
<tr><td class="left">wedge_bin</td><td class="left">Number of data points for the "wedge" statistics</td></tr>
<tr><td class="left">y_spanning</td><td class="left">The integration range of y (see Beth and White 2011)</td></tr>
<tr><td class="left">dy</td><td class="left">The integration step of y</td></tr>
<tr><td class="left">f_v</td><td class="left">Structure growth rate, \((\mathrm{d} \log D / \mathrm{d} \log a)\)</td></tr>
<tr><td class="left">xi_file_name</td><td class="left">Path to the input file: real-space \(\xi\)</td></tr>
<tr><td class="left">v_file_name</td><td class="left">Path to the input file: real-space \(v_{12}\)</td></tr>
<tr><td class="left">s_file_name</td><td class="left">Path to the input file: real-space velocity dispersion</td></tr>
<tr><td class="left">out_file_name</td><td class="left">Path to the output file</td></tr>
</tbody>
</table>


<p>
The wedge statistics will be given by "&lt;out_file_name&gt;_wedge", 2-D
plot by "&lt;out_file_name&gt;_2d", and some appendices will be given in
"&lt;out_file_name&gt;_appendix".
</p>
<p>
"fb1*b2*" are separately specified for the convenience of cross-correlation.
</p>
</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Run!</h3>
<div class="outline-text-3" id="text-4-2">


<p>
Similar to the CLPT code&hellip; E.g.:
</p>
<p>
$ ./xi_stream.exe par.txt
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Output</h3>
<div class="outline-text-3" id="text-4-3">



</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> &lt;out_file_name&gt;</h4>
<div class="outline-text-4" id="text-4-3-1">


<p>
All for biased tracers&hellip;
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="right">Column</th><th scope="col" class="left">Value</th></tr>
</thead>
<tbody>
<tr><td class="right">1</td><td class="left">\(s\) (redshift-space separation, in \(\mathrm{Mpc\ h}^{-1}\))</td></tr>
<tr><td class="right">2</td><td class="left">\(\xi^s_0\) (monopole)</td></tr>
<tr><td class="right">3</td><td class="left">\(\xi^s_2\) (quadrupole)</td></tr>
<tr><td class="right">4</td><td class="left">\(\xi^s_4\) (hexadecapole)</td></tr>
</tbody>
</table>


</div>

</div>
